In [7]:
import pandas as pd
dict = {'leo': [12,23,34], 'kate': [23,45,56], 'john': [34,56,67]}
frame = pd.DataFrame(dict, index=['1', '2', '3'])

In [8]:
frame

   leo  kate  john
1   12    23    34
2   23    45    56
3   34    56    67

In [10]:
frame = pd.DataFrame(dict, index=['1', '2', '3'], columns=['kate', 'leo', 'john', 'none'])
frame

   kate  leo  john none
1    23   12    34  NaN
2    45   23    56  NaN
3    56   34    67  NaN

In [11]:
frame['leo']

1    12
2    23
3    34
Name: leo, dtype: int64

In [12]:
frame.kate

1    23
2    45
3    56
Name: kate, dtype: int64

In [13]:
frame[['leo', 'kate']]

   leo  kate
1   12    23
2   23    45
3   34    56

In [19]:
frame[frame['leo']>30]

   kate  leo  john none
3    56   34    67  NaN

In [22]:
frame.loc['2']  #返回第二行的元素

kate     45
leo      23
john     56
none    NaN
Name: 2, dtype: object